tut05/sol05.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-16 Mi 18:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lösungen zum 5. Übungsblatt</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tobias Denkinger" />
</head>
<body>
<div id="content">
<h1 class="title">Lösungen zum 5. Übungsblatt</h1>

<div id="outline-container-org95c44bb" class="outline-2">
<h2 id="org95c44bb"><span class="section-number-2">1</span> Lösung zu Aufgabe 1</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Induktionsanfang (IA)</b>
Sei t = Node i [] für ein i :: Int.
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">product</span> <span style="color: #2aa198;">(</span>yield <span style="color: #b58900;">(</span><span style="color: #b58900;">Node</span> i <span style="color: #268bd2;">[]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> <span style="color: #268bd2;">=</span> product <span style="color: #2aa198;">[</span>i<span style="color: #2aa198;">]</span>            <span style="color: #2aa198;">(</span><span style="color: #6c71c4;">4</span><span style="color: #2aa198;">)</span>
                            <span style="color: #268bd2;">=</span> i                      <span style="color: #2aa198;">(</span><span style="color: #b58900;">L1</span><span style="color: #2aa198;">)</span>
                            <span style="color: #268bd2;">=</span> yieldProd <span style="color: #2aa198;">(</span><span style="color: #b58900;">Node</span> i <span style="color: #b58900;">[]</span><span style="color: #2aa198;">)</span>  <span style="color: #2aa198;">(</span><span style="color: #6c71c4;">8</span><span style="color: #2aa198;">)</span>
</pre>
</div>

<p>
<b>Induktionsschritt (IS)</b>
Sei k ≥ 1.  Sei t1, …, tk :: IntTree, sodass für jedes j ∈ {1, …, k} gilt:
  product (yield tj) = yieldProd tj.
</p>

<p>
Sei weiterhin i :: Int und t = Node i [t1, …, tk].
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #268bd2;">product</span> <span style="color: #2aa198;">(</span>yield <span style="color: #b58900;">(</span><span style="color: #b58900;">Node</span> i <span style="color: #268bd2;">[</span>t1, <span style="color: #268bd2;">&#8230;</span>, tk<span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #268bd2;">=</span> product <span style="color: #2aa198;">(</span>concat <span style="color: #b58900;">(</span>map yield <span style="color: #268bd2;">[</span>t1, <span style="color: #268bd2;">&#8230;</span>, tk<span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>              <span style="color: #2aa198;">(</span><span style="color: #6c71c4;">5</span><span style="color: #2aa198;">)</span>
<span style="color: #268bd2;">=</span> product <span style="color: #2aa198;">(</span>concat <span style="color: #b58900;">[</span>yield t1, <span style="color: #268bd2;">&#8230;</span>, yield tk<span style="color: #b58900;">]</span><span style="color: #2aa198;">)</span>              <span style="color: #2aa198;">(</span><span style="color: #b58900;">L2</span><span style="color: #2aa198;">)</span>
<span style="color: #268bd2;">=</span> product <span style="color: #2aa198;">[</span>product <span style="color: #b58900;">(</span>yield t1<span style="color: #b58900;">)</span>, <span style="color: #268bd2;">&#8230;</span>, product <span style="color: #b58900;">(</span>yield tk<span style="color: #b58900;">)</span><span style="color: #2aa198;">]</span>   <span style="color: #2aa198;">(</span><span style="color: #b58900;">L3</span><span style="color: #2aa198;">)</span>
<span style="color: #268bd2;">=</span> product <span style="color: #2aa198;">[</span>yieldProd t1, <span style="color: #268bd2;">&#8230;</span>, yieldProd tk<span style="color: #2aa198;">]</span>               <span style="color: #2aa198;">(</span><span style="color: #b58900;">IH</span><span style="color: #2aa198;">)</span>
<span style="color: #268bd2;">=</span> product <span style="color: #2aa198;">(</span>map yieldProd <span style="color: #b58900;">[</span>t1, <span style="color: #268bd2;">&#8230;</span>, tk<span style="color: #b58900;">]</span><span style="color: #2aa198;">)</span>                   <span style="color: #2aa198;">(</span><span style="color: #b58900;">L2</span><span style="color: #2aa198;">)</span>
<span style="color: #268bd2;">=</span> yieldProd <span style="color: #2aa198;">(</span><span style="color: #b58900;">Node</span> i <span style="color: #b58900;">[</span>t1, <span style="color: #268bd2;">&#8230;</span>, tk<span style="color: #b58900;">]</span><span style="color: #2aa198;">)</span>                        <span style="color: #2aa198;">(</span><span style="color: #6c71c4;">9</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org36112f5" class="outline-2">
<h2 id="org36112f5"><span class="section-number-2">2</span> Lösung zu Aufgabe 2 (AGS 12.4.36)</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0cc0d37" class="outline-3">
<h3 id="org0cc0d37"><span class="section-number-3">2.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b><b>jetzt ohne Fehler</b></b>
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #2aa198;">&#10216;</span>pow<span style="color: #2aa198;">&#10217;&#10216;</span><span style="color: #6c71c4;">2</span><span style="color: #2aa198;">&#10217;</span>
= <span style="color: #2aa198;">(</span>&#955;nfz. n<span style="color: #b58900;">(</span>&#955;gx. g<span style="color: #268bd2;">(</span>gx<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>fz<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">2</span><span style="color: #2aa198;">&#10217;</span>
&#8658;* <span style="color: #2aa198;">(</span>&#955;fz. <span style="color: #b58900;">&#10216;</span><span style="color: #6c71c4;">2</span><span style="color: #b58900;">&#10217;(</span>&#955;gx. g<span style="color: #268bd2;">(</span>gx<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>fz<span style="color: #2aa198;">)</span>
= <span style="color: #2aa198;">(</span>&#955;fz. <span style="color: #b58900;">(</span>&#955;xy.x<span style="color: #268bd2;">(</span>xy<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>&#955;gx. g<span style="color: #268bd2;">(</span>gx<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> f z<span style="color: #2aa198;">)</span>
&#8658;* <span style="color: #2aa198;">(</span>&#955;fz. <span style="color: #b58900;">(</span>&#955;gx. g<span style="color: #268bd2;">(</span>gx<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>&#955;gx. g<span style="color: #6c71c4;">(</span>gx<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>f<span style="color: #b58900;">)</span> z<span style="color: #2aa198;">)</span>
&#8658;* <span style="color: #2aa198;">(</span>&#955;fz. <span style="color: #b58900;">(</span>&#955;gx. g<span style="color: #268bd2;">(</span>gx<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>&#955;x. f<span style="color: #268bd2;">(</span>fx<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> z<span style="color: #2aa198;">)</span>
&#8658;* <span style="color: #2aa198;">(</span>&#955;fz. <span style="color: #b58900;">(</span>&#955;x. f<span style="color: #268bd2;">(</span>fx<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>&#955;x. f<span style="color: #6c71c4;">(</span>fx<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span> z<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
&#8658;* <span style="color: #2aa198;">(</span>&#955;fz. <span style="color: #b58900;">(</span>&#955;x. f<span style="color: #268bd2;">(</span>fx<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>f<span style="color: #268bd2;">(</span>fz<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
&#8658;* <span style="color: #2aa198;">(</span>&#955;fz. f<span style="color: #b58900;">(</span>f<span style="color: #268bd2;">(</span>f<span style="color: #6c71c4;">(</span>fz<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span> 
= <span style="color: #2aa198;">&#10216;</span><span style="color: #6c71c4;">4</span><span style="color: #2aa198;">&#10217;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf8beb61" class="outline-3">
<h3 id="orgf8beb61"><span class="section-number-3">2.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-2-2">
<p>
f(n) = 2ⁿ
</p>
</div>
</div>

<div id="outline-container-org4a176a2" class="outline-3">
<h3 id="org4a176a2"><span class="section-number-3">2.3</span> Zusatzaufgabe c</h3>
<div class="outline-text-3" id="text-2-3">
<p>
⟨pot⟩ = (λnmfz. nmfz)
</p>
</div>
</div>
</div>

<div id="outline-container-orgdabfe13" class="outline-2">
<h2 id="orgdabfe13"><span class="section-number-2">3</span> Lösung zu Aufgabe 3 (AGS 12.4.29)</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org226b07d" class="outline-3">
<h3 id="org226b07d"><span class="section-number-3">3.1</span> Teilaufgabe a</h3>
<div class="outline-text-3" id="text-3-1">
<p>
A = (λxyz. y)
</p>
</div>
</div>

<div id="outline-container-org78fc04a" class="outline-3">
<h3 id="org78fc04a"><span class="section-number-3">3.2</span> Teilaufgabe b</h3>
<div class="outline-text-3" id="text-3-2">
<p>
B = (λxy. yx)
</p>
</div>
</div>

<div id="outline-container-org5792523" class="outline-3">
<h3 id="org5792523"><span class="section-number-3">3.3</span> Teilaufgabe c</h3>
<div class="outline-text-3" id="text-3-3">
<p>
C = (λx. xx)
</p>
</div>
</div>

<div id="outline-container-orge7cf967" class="outline-3">
<h3 id="orge7cf967"><span class="section-number-3">3.4</span> Teilaufgabe d</h3>
<div class="outline-text-3" id="text-3-4">
<p>
D = ((λx. xx)(λx. xx))
</p>
</div>
</div>

<div id="outline-container-org703b96b" class="outline-3">
<h3 id="org703b96b"><span class="section-number-3">3.5</span> Teilaufgabe e</h3>
<div class="outline-text-3" id="text-3-5">
<p>
E = (λxy. xyx)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-05-16</p>
<p class="author">Author: Tobias Denkinger</p>
<p class="date">Created: 2018-05-16 Mi 18:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
